bookmark-backend/app/services/bookmark_service.rb

  def create(params)
    bookmark = Bookmark.new(params)
    if bookmark.save
---
INSERT INTO "bookmarks" ("title", "url", "created_at", "updated_at") VALUES ('фыаы', 'https://www.onliner.by/', '2025-03-27 13:28:15.965689', '2025-03-27 13:28:15.965689') RETURNING "id"

  def destroy(bookmark)
    bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 3