bookmark-backend/app/graphql/mutations/delete_bookmark.rb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 3 LIMIT 1
---
    def resolve(input:)
      bookmark = Bookmark.find_by(id: input.id)