bookmark-backend/app/graphql/mutations/update_bookmark.rb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 2 LIMIT 1
UPDATE "bookmarks" SET "title" = '3', "updated_at" = '2025-03-27 15:34:51.528031' WHERE "bookmarks"."id" = 2
---
    def resolve(input:)
      bookmark = Bookmark.find_by(id: input.id)
      unless bookmark
        return {
          bookmark: nil,
          errors: ["Закладка не найдена"]
        }
      end

      if bookmark.update(title: input.title, url: input.url)